//// Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
////и на выходе показывает вторую цифру этого числа.


// int number = new Random().Next(100, 1000);
// Console.WriteLine(number);

// int number1 = number / 10;
// int number2 = number1 % 10;

// Console.WriteLine(number2);

/////Задача 13: Напишите программу, которая выводит третью цифру заданного числа 
////или сообщает, что третьей цифры нет.

// int number = new Random().Next(1, 100000);
// Console.WriteLine(number);


// if (number > 99)
// {
//     string number1 = "";
//     number1 = Convert.ToString(number);
//     Console.WriteLine(number1[2]);
// }
// else
// {
//     Console.WriteLine("This number is not have thirdiget");
// }


//// Напишите программу, которая
//// принимает на вход цифру, обозначающую
//// день недели, и проверяет, является ли этот
/// день выходным.

// Console.Write("Enter number of day"); 
// int number = Convert.ToInt32(Console.ReadLine()); 
// if (number >= 1 && number <=5) 
// {
//     Console.WriteLine("is not Day off");
// }
// else if (number==6 || number ==7)
// {
//     Console.WriteLine ("This is Day Off");
// }
// else 
// {
//   Console.WriteLine("data entry error");
// }

